/******************************************************************************
 ******************************************************************************
 **                                                                          **
 **                          ファイルヘッダー                                  **
 **                          File: ansi_log_color.h                          **
 **                                                                          **
 ******************************************************************************
 ******************************************************************************/

#ifndef ANSI_LOG_COLOR_H
#define ANSI_LOG_COLOR_H

/******************************************************************************
 *                                                                            *
 *                              ANSIカラーコード定義                           *
 *                                                                            *
 ******************************************************************************/
typedef enum {
  RESET,
  BLACK,
  RED,
  GREEN,
  YELLOW,
  BLUE,
  MAGENTA,
  CYAN,
  WHITE,
  BRIGHT_BLACK,
  BRIGHT_RED,
  BRIGHT_GREEN,
  BRIGHT_YELLOW,
  BRIGHT_BLUE,
  BRIGHT_MAGENTA,
  BRIGHT_CYAN,
  BRIGHT_WHITE
} ANSIColorCode_t;

#endif  // ANSI_LOG_COLOR_H